## 1. Analysis Seoul CCTV
- 데이터읽기

In [89]:
import pandas as pd

In [90]:
CCTV_Seoul = pd.read_csv("../data/01. Seoul_CCTV.csv", encoding='utf-8')

In [91]:
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [92]:
CCTV_Seoul.tail()

    기관명    소계  2013년도 이전  2014년  2015년  2016년
20  용산구  2096       1368    218    112    398
21  은평구  2108       1138    224    278    468
22  종로구  1619        464    314    211    630
23   중구  1023        413    190     72    348
24  중랑구   916        509    121    177    109

In [93]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [94]:
CCTV_Seoul.columns[0]

'기관명'

In [95]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: "구별"})

      구별    소계  2013년도 이전  2014년  2015년  2016년
0    강남구  3238       1292    430    584    932
1    강동구  1010        379     99    155    377
2    강북구   831        369    120    138    204
3    강서구   911        388    258    184     81
4    관악구  2109        846    260    390    613
5    광진구   878        573     78     53    174
6    구로구  1884       1142    173    246    323
7    금천구  1348        674     51    269    354
8    노원구  1566        542     57    451    516
9    도봉구   825        238    159     42    386
10  동대문구  1870       1070     23    198    579
11   동작구  1302        544    341    103    314
12   마포구   980        314    118    169    379
13  서대문구  1254        844     50     68    292
14   서초구  2297       1406    157    336    398
15   성동구  1327        730     91    241    265
16   성북구  1651       1009     78    360    204
17   송파구  1081        529     21     68    463
18   양천구  2482       1843    142     30    467
19  영등포구  1277        495    214    195    373
20   용산구  2096       1368    218    112    398
21   은평구  2108       1138    224    278    468
22   종로구  1619        464    314    211    630
23    중구  1023        413    190     72    348
24   중랑구   916        509    121    177    109

In [96]:
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [97]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: "구별"}, inplace=True)

In [98]:
CCTV_Seoul.head() #원본까지 변경완료

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [99]:
pop_Seoul = pd.read_excel(
    "../data/01. Seoul_Population.xls", header=2, usecols="B,D,G,J,N"
)

In [100]:
pop_Seoul.head()

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10124579  9857426  267153   1365126
1  종로구    164257   154770    9487     26182
2   중구    134593   125709    8884     21384
3  용산구    244444   229161   15283     36882
4  성동구    312711   304808    7903     41273

In [101]:
pop_Seoul.rename(
    columns={
        pop_Seoul.columns[0] : "구별",
        pop_Seoul.columns[1] : "인구수",
        pop_Seoul.columns[2] : "한국인",
        pop_Seoul.columns[3] : "외국인",
        pop_Seoul.columns[4] : "고령자",
    }, inplace=True
)

In [102]:
pop_Seoul.head()

    구별       인구수      한국인     외국인      고령자
0   합계  10124579  9857426  267153  1365126
1  종로구    164257   154770    9487    26182
2   중구    134593   125709    8884    21384
3  용산구    244444   229161   15283    36882
4  성동구    312711   304808    7903    41273

### Pandas 기초

- Python에서 R만큼의 강력한 데이터 핸들링 성능을 제공하는 모듈
- 단일 프로세스에서는  최대 효율
- 코딩 가능하고 응용 가능한 엑셀로 받아들여도 됨
- 누군가 스테로이드를 맞은 엑셀로 표현함

#### series ####
- index와 value로 이루어져 있다.
- 한 가지 데이터 타입만 가질 수 있다.

In [103]:
import pandas as pd
import numpy as np

- pandas 는 통상 pd
- numpy 는 통상 np

In [104]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [105]:
pd.Series([1,2,3,4,5], dtype=np.float64)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [106]:
pd.Series([1,2,3,4,5], dtype=str)

0    1
1    2
2    3
3    4
4    5
dtype: object

In [107]:
pd.Series(np.array([1,2,3,4,5]))

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [108]:
pd.Series({"key":"Value"})

key    Value
dtype: object

In [109]:
pd.Series([1,2,3,'4',5])

0    1
1    2
2    3
3    4
4    5
dtype: object

In [110]:
# 짝수를 찾고 싶다.

data = pd.Series([1,2,3,4,5])
data % 2

0    1
1    0
2    1
3    0
4    1
dtype: int64

#### 날짜데이터

In [111]:
dates = pd.date_range("20210101", periods=6) #원하는 기간만큼 날짜 생성가능

### DataFrame
- pd.Series()
    - index, value
- pd.DataFrame()
    - index, column, value

In [112]:
# 표준정규분포에서 난수 발생
data = np.random.randn(6,4)

In [113]:
df = pd.DataFrame(data,index=dates,columns=["A","B","C","D"])

### 데이터프레임의 정보탐색
 - df.head()

In [114]:
df.head()

                   A         B         C         D
2021-01-01 -0.050159  0.438206 -0.569009  0.127928
2021-01-02  0.856550  1.692291  0.931037 -1.375512
2021-01-03  0.190934  0.045736 -0.508101  0.412002
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134
2021-01-05 -1.518301  0.832872  2.408465 -1.012453

In [115]:
df.tail()

                   A         B         C         D
2021-01-02  0.856550  1.692291  0.931037 -1.375512
2021-01-03  0.190934  0.045736 -0.508101  0.412002
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134
2021-01-05 -1.518301  0.832872  2.408465 -1.012453
2021-01-06  0.091324  0.736245 -0.716149  2.318478

In [116]:
df.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [117]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [118]:
df.values

array([[-0.05015922,  0.43820595, -0.56900882,  0.12792813],
       [ 0.85655029,  1.6922909 ,  0.93103679, -1.37551187],
       [ 0.19093355,  0.04573577, -0.50810127,  0.41200237],
       [-0.22239657,  0.73460789, -0.27987049, -1.06113377],
       [-1.51830104,  0.83287228,  2.40846506, -1.01245254],
       [ 0.0913239 ,  0.73624512, -0.71614905,  2.3184779 ]])

In [119]:
df.info()  #데이터 프레임의 기본정보를 확인

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-01-01 to 2021-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [120]:
df.describe() #데이터 프레임의 기본 통계정보를 확인

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.108675  0.746660  0.211062 -0.098448
std    0.782921  0.545590  1.230722  1.381767
min   -1.518301  0.045736 -0.716149 -1.375512
25%   -0.179337  0.512306 -0.553782 -1.048963
50%    0.020582  0.735427 -0.393986 -0.442262
75%    0.166031  0.808715  0.628310  0.340984
max    0.856550  1.692291  2.408465  2.318478

### 데이터 정렬
- sort_values()
- 특정 컬럼(열)을 기준으로 데이터를 정렬 합니다.

In [121]:
df

                   A         B         C         D
2021-01-01 -0.050159  0.438206 -0.569009  0.127928
2021-01-02  0.856550  1.692291  0.931037 -1.375512
2021-01-03  0.190934  0.045736 -0.508101  0.412002
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134
2021-01-05 -1.518301  0.832872  2.408465 -1.012453
2021-01-06  0.091324  0.736245 -0.716149  2.318478

In [122]:
df.sort_values(by="B", ascending=False) #내림차순

                   A         B         C         D
2021-01-02  0.856550  1.692291  0.931037 -1.375512
2021-01-05 -1.518301  0.832872  2.408465 -1.012453
2021-01-06  0.091324  0.736245 -0.716149  2.318478
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134
2021-01-01 -0.050159  0.438206 -0.569009  0.127928
2021-01-03  0.190934  0.045736 -0.508101  0.412002

In [123]:
df.sort_values(by="B", ascending=False, inplace=True) #저장

In [124]:
df

                   A         B         C         D
2021-01-02  0.856550  1.692291  0.931037 -1.375512
2021-01-05 -1.518301  0.832872  2.408465 -1.012453
2021-01-06  0.091324  0.736245 -0.716149  2.318478
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134
2021-01-01 -0.050159  0.438206 -0.569009  0.127928
2021-01-03  0.190934  0.045736 -0.508101  0.412002

### 데이터 선택

In [125]:
df

                   A         B         C         D
2021-01-02  0.856550  1.692291  0.931037 -1.375512
2021-01-05 -1.518301  0.832872  2.408465 -1.012453
2021-01-06  0.091324  0.736245 -0.716149  2.318478
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134
2021-01-01 -0.050159  0.438206 -0.569009  0.127928
2021-01-03  0.190934  0.045736 -0.508101  0.412002

In [126]:
#한 개 컬럼 선택
df["A"]

2021-01-02    0.856550
2021-01-05   -1.518301
2021-01-06    0.091324
2021-01-04   -0.222397
2021-01-01   -0.050159
2021-01-03    0.190934
Name: A, dtype: float64

In [127]:
type(df["A"])

pandas.core.series.Series

In [128]:
df.A

2021-01-02    0.856550
2021-01-05   -1.518301
2021-01-06    0.091324
2021-01-04   -0.222397
2021-01-01   -0.050159
2021-01-03    0.190934
Name: A, dtype: float64

In [129]:
# 두 개 이상 컬럼 선택

df[['A','B']]

                   A         B
2021-01-02  0.856550  1.692291
2021-01-05 -1.518301  0.832872
2021-01-06  0.091324  0.736245
2021-01-04 -0.222397  0.734608
2021-01-01 -0.050159  0.438206
2021-01-03  0.190934  0.045736

### offset index

- [n:m] : n부터 m-1 까지
- 인덱스나 컬럼의 이름으로 slice 하는 경우는 끝을 포함합니다.

In [130]:
df

                   A         B         C         D
2021-01-02  0.856550  1.692291  0.931037 -1.375512
2021-01-05 -1.518301  0.832872  2.408465 -1.012453
2021-01-06  0.091324  0.736245 -0.716149  2.318478
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134
2021-01-01 -0.050159  0.438206 -0.569009  0.127928
2021-01-03  0.190934  0.045736 -0.508101  0.412002

In [131]:
df[0:3]

                   A         B         C         D
2021-01-02  0.856550  1.692291  0.931037 -1.375512
2021-01-05 -1.518301  0.832872  2.408465 -1.012453
2021-01-06  0.091324  0.736245 -0.716149  2.318478

In [132]:
df["20210104":"20210103"]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

- loc : location
- index 이름으로 특정 행, 열을 선택합니다.

In [133]:
df.sort_values(by="A" ,ascending=True, inplace=True) #저장

In [134]:
df

                   A         B         C         D
2021-01-05 -1.518301  0.832872  2.408465 -1.012453
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134
2021-01-01 -0.050159  0.438206 -0.569009  0.127928
2021-01-06  0.091324  0.736245 -0.716149  2.318478
2021-01-03  0.190934  0.045736 -0.508101  0.412002
2021-01-02  0.856550  1.692291  0.931037 -1.375512

In [135]:
df.loc[:, ["A", "B"]]

                   A         B
2021-01-05 -1.518301  0.832872
2021-01-04 -0.222397  0.734608
2021-01-01 -0.050159  0.438206
2021-01-06  0.091324  0.736245
2021-01-03  0.190934  0.045736
2021-01-02  0.856550  1.692291

In [136]:
df.loc["20210103":"20210104", ["A", "B"]]

                   A         B
2021-01-04 -0.222397  0.734608
2021-01-03  0.190934  0.045736

In [137]:
df.loc["20210103":"20210105", "A":"D"]

                   A         B         C         D
2021-01-05 -1.518301  0.832872  2.408465 -1.012453
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134
2021-01-03  0.190934  0.045736 -0.508101  0.412002

- iloc : integer location
    - 컴퓨터가 인식하는 인덱스 값으로 선택

In [138]:
df.iloc[3]

A    0.091324
B    0.736245
C   -0.716149
D    2.318478
Name: 2021-01-06 00:00:00, dtype: float64

In [139]:
df.iloc[[1,2,4,],[0,2]]

                   A         C
2021-01-04 -0.222397 -0.279870
2021-01-01 -0.050159 -0.569009
2021-01-03  0.190934 -0.508101

In [140]:
df.iloc[:, 1:3]

                   B         C
2021-01-05  0.832872  2.408465
2021-01-04  0.734608 -0.279870
2021-01-01  0.438206 -0.569009
2021-01-06  0.736245 -0.716149
2021-01-03  0.045736 -0.508101
2021-01-02  1.692291  0.931037

### 컬럼 추가
- 기존 컬럼이 없으면 추가
- 기존 컬럼이 있으면 수정

In [141]:
df

                   A         B         C         D
2021-01-05 -1.518301  0.832872  2.408465 -1.012453
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134
2021-01-01 -0.050159  0.438206 -0.569009  0.127928
2021-01-06  0.091324  0.736245 -0.716149  2.318478
2021-01-03  0.190934  0.045736 -0.508101  0.412002
2021-01-02  0.856550  1.692291  0.931037 -1.375512

In [142]:
df["E"] = ["one", "one","two","three","four","five"]
df

                   A         B         C         D      E
2021-01-05 -1.518301  0.832872  2.408465 -1.012453    one
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134    one
2021-01-01 -0.050159  0.438206 -0.569009  0.127928    two
2021-01-06  0.091324  0.736245 -0.716149  2.318478  three
2021-01-03  0.190934  0.045736 -0.508101  0.412002   four
2021-01-02  0.856550  1.692291  0.931037 -1.375512   five

- isin()
- 특정 요소가 있는지 확인

In [143]:
df['E'].isin(['two','four'])

2021-01-05    False
2021-01-04    False
2021-01-01     True
2021-01-06    False
2021-01-03     True
2021-01-02    False
Name: E, dtype: bool

### 특정 컬럼 제거
- del
- drop

In [144]:
df

                   A         B         C         D      E
2021-01-05 -1.518301  0.832872  2.408465 -1.012453    one
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134    one
2021-01-01 -0.050159  0.438206 -0.569009  0.127928    two
2021-01-06  0.091324  0.736245 -0.716149  2.318478  three
2021-01-03  0.190934  0.045736 -0.508101  0.412002   four
2021-01-02  0.856550  1.692291  0.931037 -1.375512   five

In [145]:
del df["E"]
df

                   A         B         C         D
2021-01-05 -1.518301  0.832872  2.408465 -1.012453
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134
2021-01-01 -0.050159  0.438206 -0.569009  0.127928
2021-01-06  0.091324  0.736245 -0.716149  2.318478
2021-01-03  0.190934  0.045736 -0.508101  0.412002
2021-01-02  0.856550  1.692291  0.931037 -1.375512

In [146]:
df.drop("D", axis=1)
#0은 가로 1은 세로

                   A         B         C
2021-01-05 -1.518301  0.832872  2.408465
2021-01-04 -0.222397  0.734608 -0.279870
2021-01-01 -0.050159  0.438206 -0.569009
2021-01-06  0.091324  0.736245 -0.716149
2021-01-03  0.190934  0.045736 -0.508101
2021-01-02  0.856550  1.692291  0.931037

In [147]:
df.drop("20210101", axis=0)

                   A         B         C         D
2021-01-05 -1.518301  0.832872  2.408465 -1.012453
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134
2021-01-06  0.091324  0.736245 -0.716149  2.318478
2021-01-03  0.190934  0.045736 -0.508101  0.412002
2021-01-02  0.856550  1.692291  0.931037 -1.375512

In [148]:
df["A"].apply("sum")

-0.6520490924207676

In [149]:
df["A"].apply("mean")

-0.1086748487367946

In [150]:
df["A"].apply("max")

0.856550290993207

In [151]:
df["A"].apply("min")

-1.518301043527981

In [152]:
df[["A","D"]].apply("sum")

A   -0.652049
D   -0.590690
dtype: float64

In [153]:
df["A"].apply(np.sum)

2021-01-05   -1.518301
2021-01-04   -0.222397
2021-01-01   -0.050159
2021-01-06    0.091324
2021-01-03    0.190934
2021-01-02    0.856550
Name: A, dtype: float64

In [154]:
df

                   A         B         C         D
2021-01-05 -1.518301  0.832872  2.408465 -1.012453
2021-01-04 -0.222397  0.734608 -0.279870 -1.061134
2021-01-01 -0.050159  0.438206 -0.569009  0.127928
2021-01-06  0.091324  0.736245 -0.716149  2.318478
2021-01-03  0.190934  0.045736 -0.508101  0.412002
2021-01-02  0.856550  1.692291  0.931037 -1.375512

In [155]:
def plusminus(num):
    return "plus" if num > 0 else "minus"

In [156]:
df["A"].apply(plusminus)

2021-01-05    minus
2021-01-04    minus
2021-01-01    minus
2021-01-06     plus
2021-01-03     plus
2021-01-02     plus
Name: A, dtype: object

In [157]:
df["B"].apply(lambda num: "plus" if num > 0 else "minus")

2021-01-05    plus
2021-01-04    plus
2021-01-01    plus
2021-01-06    plus
2021-01-03    plus
2021-01-02    plus
Name: B, dtype: object

In [159]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [160]:
CCTV_Seoul.sort_values(by="소계", ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년
0   강남구  3238       1292    430    584    932
18  양천구  2482       1843    142     30    467
14  서초구  2297       1406    157    336    398
4   관악구  2109        846    260    390    613
21  은평구  2108       1138    224    278    468

In [172]:
CCTV_Seoul["최근증가율"] = (
    (CCTV_Seoul["2016년"] +CCTV_Seoul["2015년"] + CCTV_Seoul["2014년"])
     / CCTV_Seoul["2013년도 이전"] 
     * 100
    )
CCTV_Seoul.sort_values(by="최근증가율", ascending=False).head(5) #최근증가율이 높은 5개 구

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1619        464    314    211    630  248.922414
9   도봉구   825        238    159     42    386  246.638655
12  마포구   980        314    118    169    379  212.101911
8   노원구  1566        542     57    451    516  188.929889
1   강동구  1010        379     99    155    377  166.490765

In [173]:
pop_Seoul.head()

    구별       인구수      한국인     외국인      고령자
0   합계  10124579  9857426  267153  1365126
1  종로구    164257   154770    9487    26182
2   중구    134593   125709    8884    21384
3  용산구    244444   229161   15283    36882
4  성동구    312711   304808    7903    41273

In [174]:
pop_Seoul.drop([0], inplace=True) #0번째 행 삭제
pop_Seoul.head()

    구별     인구수     한국인    외국인    고령자
1  종로구  164257  154770   9487  26182
2   중구  134593  125709   8884  21384
3  용산구  244444  229161  15283  36882
4  성동구  312711  304808   7903  41273
5  광진구  372298  357703  14595  43953

In [175]:
pop_Seoul["구별"].unique()

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구'], dtype=object)

In [176]:
pop_Seoul["외국인비율"] = pop_Seoul["외국인"] / pop_Seoul["인구수"] * 100
pop_Seoul["고령자비율"] = pop_Seoul["고령자"] / pop_Seoul["인구수"] * 100
pop_Seoul.head()

    구별     인구수     한국인    외국인    고령자     외국인비율      고령자비율
1  종로구  164257  154770   9487  26182  5.775705  15.939656
2   중구  134593  125709   8884  21384  6.600640  15.887899
3  용산구  244444  229161  15283  36882  6.252148  15.088118
4  성동구  312711  304808   7903  41273  2.527254  13.198448
5  광진구  372298  357703  14595  43953  3.920247  11.805865

In [187]:
pop_Seoul.sort_values(by=["외국인비율"], ascending=False).head(5)

      구별     인구수     한국인    외국인    고령자     외국인비율      고령자비율
19  영등포구  402024  368550  33474  53981  8.326369  13.427308
18   금천구  253491  235154  18337  34170  7.233787  13.479769
17   구로구  441559  410742  30817  58794  6.979135  13.315095
2     중구  134593  125709   8884  21384  6.600640  15.887899
3    용산구  244444  229161  15283  36882  6.252148  15.088118